In [5]:
import pandas as pd

In [6]:
df=pd.read_csv('../practice/sample1.csv')

In [7]:
df.head()

   sno             name   age   salary     designation        mobile
0    1    shabeeh abaas  23.0  $20,000         manager  9.140098e+09
1    2  kashish agrawal  21.0  $23,000        manager   3.242343e+08
2    3     nisha shukla  22.0  $32,000  region manager  2.903482e+09
3    4     kriti rajput  22.0   $3,333             NaN           NaN
4    5     deepak gupta  23.0  $33,000         manager  2.343243e+08

In [9]:
def salaryclean(salary):
    if isinstance(salary,str):
        salary=salary.strip()
        if '$' in salary:
            salary=salary.replace('$','')
        if ',' in salary:
            salary=salary.replace(',','')
        salary=int(salary)
    return salary

In [11]:
#test run for data cleaning
df['salary'].apply(salaryclean)

0    20000.0
1    23000.0
2    32000.0
3     3333.0
4    33000.0
5        NaN
6    23333.0
7     3333.0
Name: salary, dtype: float64

In [14]:
#final apply
df['salary']=df['salary'].apply(salaryclean)
df

   sno             name   age   salary     designation        mobile
0    1    shabeeh abaas  23.0  20000.0         manager  9.140098e+09
1    2  kashish agrawal  21.0  23000.0        manager   3.242343e+08
2    3     nisha shukla  22.0  32000.0  region manager  2.903482e+09
3    4     kriti rajput  22.0   3333.0             NaN           NaN
4    5     deepak gupta  23.0  33000.0         manager  2.343243e+08
5    6     mayank singh  23.0      NaN  region manager  2.334243e+08
6    7     aditya sagar   NaN  23333.0         manager  2.342423e+09
7    8         prashant  22.0   3333.0        director  2.324343e+07

In [15]:
# now removing inappropriate column like mobile
df.drop(['mobile','sno','name'],axis=1,inplace=True)
df

    age   salary     designation
0  23.0  20000.0         manager
1  21.0  23000.0        manager
2  22.0  32000.0  region manager
3  22.0   3333.0             NaN
4  23.0  33000.0         manager
5  23.0      NaN  region manager
6   NaN  23333.0         manager
7  22.0   3333.0        director

In [16]:
#fill missing values by using scikit learn
from sklearn.impute import SimpleImputer

In [17]:
imputer=SimpleImputer()

In [18]:
cols=["age","salary"]
df[cols]=imputer.fit_transform(df[cols])

In [19]:
df

         age        salary     designation
0  23.000000  20000.000000         manager
1  21.000000  23000.000000        manager
2  22.000000  32000.000000  region manager
3  22.000000   3333.000000             NaN
4  23.000000  33000.000000         manager
5  23.000000  19714.142857  region manager
6  22.285714  23333.000000         manager
7  22.000000   3333.000000        director

In [21]:
df.ndim

2

In [22]:
df['designation'].value_counts()

manager           3
region manager    2
manager           1
director          1
Name: designation, dtype: int64

In [23]:
imp2=SimpleImputer(strategy='most_frequent')
df['designation']=imp2.fit_transform(df[['designation']])
df

         age        salary     designation
0  23.000000  20000.000000         manager
1  21.000000  23000.000000        manager
2  22.000000  32000.000000  region manager
3  22.000000   3333.000000         manager
4  23.000000  33000.000000         manager
5  23.000000  19714.142857  region manager
6  22.285714  23333.000000         manager
7  22.000000   3333.000000        director

In [24]:
#add column
gender=['male','female']*4

In [25]:
df['gender']=gender
df

         age        salary     designation  gender
0  23.000000  20000.000000         manager    male
1  21.000000  23000.000000        manager   female
2  22.000000  32000.000000  region manager    male
3  22.000000   3333.000000         manager  female
4  23.000000  33000.000000         manager    male
5  23.000000  19714.142857  region manager  female
6  22.285714  23333.000000         manager    male
7  22.000000   3333.000000        director  female

In [26]:
#rename any column
df.rename({'salary':'pay'},axis=1,inplace=True)
df

         age           pay     designation  gender
0  23.000000  20000.000000         manager    male
1  21.000000  23000.000000        manager   female
2  22.000000  32000.000000  region manager    male
3  22.000000   3333.000000         manager  female
4  23.000000  33000.000000         manager    male
5  23.000000  19714.142857  region manager  female
6  22.285714  23333.000000         manager    male
7  22.000000   3333.000000        director  female

In [29]:
#adding row
df.loc[0]

age               23.0
pay            20000.0
designation    manager
gender            male
Name: 0, dtype: object

In [30]:
row=[{
    'age':19,
    'pay':4444,
    'designation':'manager',
    'gender':'male'
},
{
    'age':44,
    'pay':5233,
    'designation':'manager',
    'gender':'female'
}]

In [31]:
df=df.append(row,ignore_index=True)
df

C:\Users\ASUS\AppData\Local\Temp\ipykernel_4632\3456989694.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(row,ignore_index=True)

         age           pay     designation  gender
0  23.000000  20000.000000         manager    male
1  21.000000  23000.000000        manager   female
2  22.000000  32000.000000  region manager    male
3  22.000000   3333.000000         manager  female
4  23.000000  33000.000000         manager    male
5  23.000000  19714.142857  region manager  female
6  22.285714  23333.000000         manager    male
7  22.000000   3333.000000        director  female
8  19.000000   4444.000000         manager    male
9  44.000000   5233.000000         manager  female

In [32]:
df['gender'].value_counts()

male      5
female    5
Name: gender, dtype: int64

In [33]:
from sklearn.preprocessing import LabelEncoder

In [34]:
#step one create object and fit(train)
gender_enc=LabelEncoder()
gender_enc.fit(df['gender'])

LabelEncoder()

In [35]:
#second step tranformation(testing)
df['gender']=gender_enc.transform(df['gender'])
df

         age           pay     designation  gender
0  23.000000  20000.000000         manager       1
1  21.000000  23000.000000        manager        0
2  22.000000  32000.000000  region manager       1
3  22.000000   3333.000000         manager       0
4  23.000000  33000.000000         manager       1
5  23.000000  19714.142857  region manager       0
6  22.285714  23333.000000         manager       1
7  22.000000   3333.000000        director       0
8  19.000000   4444.000000         manager       1
9  44.000000   5233.000000         manager       0

In [36]:
gender_enc.classes_

array(['female', 'male'], dtype=object)

In [37]:
gender_enc.inverse_transform([1,0])

array(['male', 'female'], dtype=object)

In [38]:
#if our data has multiple values in any column then we use onehotencoder
df['designation'].value_counts()

manager           6
region manager    2
manager           1
director          1
Name: designation, dtype: int64

In [40]:
df.designation.unique()
#we have multiple unique values in data so we use onehotencoder

array(['manager', 'manager ', 'region manager', 'director'], dtype=object)

In [41]:
df.designation.nunique()

4

NOW DUMMY VARIABLE CREATION BY ONEHOTENCODER

In [42]:
from sklearn.preprocessing import OneHotEncoder

In [46]:
desig_enc=OneHotEncoder(drop='first')
desig_enc.fit(df[['designation']]) #it creates an object for onehotencoder

OneHotEncoder(drop='first')

In [47]:
designation_dummies=desig_enc.transform(df[['designation']]).toarray()

In [48]:
df.drop(columns=['designation'],axis=1,inplace=True)

In [49]:
df.values

array([[2.30000000e+01, 2.00000000e+04, 1.00000000e+00],
       [2.10000000e+01, 2.30000000e+04, 0.00000000e+00],
       [2.20000000e+01, 3.20000000e+04, 1.00000000e+00],
       [2.20000000e+01, 3.33300000e+03, 0.00000000e+00],
       [2.30000000e+01, 3.30000000e+04, 1.00000000e+00],
       [2.30000000e+01, 1.97141429e+04, 0.00000000e+00],
       [2.22857143e+01, 2.33330000e+04, 1.00000000e+00],
       [2.20000000e+01, 3.33300000e+03, 0.00000000e+00],
       [1.90000000e+01, 4.44400000e+03, 1.00000000e+00],
       [4.40000000e+01, 5.23300000e+03, 0.00000000e+00]])

In [50]:
#now we add two numpy matrix
import numpy as np

In [51]:
data=np.hstack((designation_dummies,df.values))

In [52]:
data.shape

(10, 6)

In [53]:
desig_dummy_df=pd.DataFrame(designation_dummies)
desig_dummy_df.head()

     0    1    2
0  1.0  0.0  0.0
1  0.0  1.0  0.0
2  0.0  0.0  1.0
3  1.0  0.0  0.0
4  1.0  0.0  0.0

In [54]:
data_df=pd.concat([desig_dummy_df,df],axis=1)

In [55]:
data_df.head()

     0    1    2   age      pay  gender
0  1.0  0.0  0.0  23.0  20000.0       1
1  0.0  1.0  0.0  21.0  23000.0       0
2  0.0  0.0  1.0  22.0  32000.0       1
3  1.0  0.0  0.0  22.0   3333.0       0
4  1.0  0.0  0.0  23.0  33000.0       1

In [56]:
#now we nee to drop the first col for the ml algo for the humanity
#scaling the data
#(ml algo should undersatnd all the col important)
#so we scale the column and give importance to all the col
#two methods to scale:1> minmax scaling 2>standard scaling

In [60]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler

In [61]:
mxscaler=MinMaxScaler()
mxscaler.fit(data_df)
scaled_data=mxscaler.transform(data_df)
print(scaled_data)

[[1.         0.         0.         0.16       0.56180268 1.        ]
 [0.         1.         0.         0.08       0.66292514 0.        ]
 [0.         0.         1.         0.12       0.96629251 1.        ]
 [1.         0.         0.         0.12       0.         0.        ]
 [1.         0.         0.         0.16       1.         1.        ]
 [0.         0.         1.         0.16       0.55216715 0.        ]
 [1.         0.         0.         0.13142857 0.67414973 1.        ]
 [0.         0.         0.         0.12       0.         0.        ]
 [1.         0.         0.         0.         0.03744902 1.        ]
 [1.         0.         0.         1.         0.06404422 0.        ]]

C:\Users\ASUS\miniconda3\envs\digi1\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(
C:\Users\ASUS\miniconda3\envs\digi1\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

In [ ]:
stdscaler=StandardScaler()
stdscaler.fit(data_df)
scaled_data=stdscaler.transform(data_df)

In [65]:
print(scaled_data)

[[ 0.81649658 -0.33333333 -0.5        -0.16790696  0.29255258  1.        ]
 [-1.22474487  3.         -0.5        -0.46546359  0.56169136 -1.        ]
 [-1.22474487 -0.33333333  2.         -0.31668527  1.36910771  1.        ]
 [ 0.81649658 -0.33333333 -0.5        -0.31668527 -1.20269279 -1.        ]
 [ 0.81649658 -0.33333333 -0.5        -0.16790696  1.45882064  1.        ]
 [-1.22474487 -0.33333333  2.         -0.16790696  0.26690749 -1.        ]
 [ 0.81649658 -0.33333333 -0.5        -0.27417718  0.59156576  1.        ]
 [-1.22474487 -0.33333333 -0.5        -0.31668527 -1.20269279 -1.        ]
 [ 0.81649658 -0.33333333 -0.5        -0.76302022 -1.10302173  1.        ]
 [ 0.81649658 -0.33333333 -0.5         2.95643768 -1.03223823 -1.        ]]